Repository: nhannhan159/PAT
Catalog: PAT.Common/Resources.*-*.resx
Languages: chs, cht, de, ja, ko, vi

# ModelCheckingForm_CheckBox_POR_CheckedChanged_Partial_Order_Reduction_Selected
source: Partial Order Reduction Selected
chs: 使用偏序归约
cht: 使用偏序歸約
de: Teilweise Auftrags-Verkleinerung vorgewählt
ja: Partial Order Reductionが選択されました
ko: Partial Order Reduction 사용
vi: Chọn Partial Order Reduction

source: Streett Automata Generated with {0} Nodes {1} Edges (checked in {2}s).
chs: Streett自动机有{0}个结点和{1}条边，检验它花费了{2}秒
cht: Streett自動機有{0}個結點和{1}條邊，檢驗它花費了{2}秒
de: Die Streett Automaten, die erzeugt werden mit {0} Nullpunkten {1} umrandet (überprüftes innen {2} s).
ja: ノード数:{0}, エッジ数:{1}のStreettオートマトンが生成されました (checked in {2}s).
ko: 생성된 Streett 오토마타에는 {0} 개의 노드와 {1} 개의 에지가 있으면 검증에 {2}초가 걸렸습니다.
vi: Streett Automata được sinh ra gồm {0} trạng thái {1} cạnh (kiểm tra trong {2}s).

source: Simulation Cancelled
chs: 模拟取消
cht: 模擬取消
de: Simulation annullierte
ja: シミュレーションが取り消されました
ko: 시뮬레이션이 취소되었습니다.
vi: Hủy quá trình giả lập

source: Select an assertion to start with
chs: 选择一个断言
cht: 選擇一個斷言
de: Wählen Sie eine Behauptung vor, um mit zu beginnen
ja: まずはじめにassertionを選択してください。
ko: 시작할 단언을 선택하십시오.
vi: Chọn tính chất cần kiểm tra

source: Trace Play Stopped
chs: 取消重现轨迹
cht: 取消重現軌跡
de: Spuren-Spiel gestoppt
ja: トレースの再生を停止しました
ko: 트레이스 실행이 중지되었습니다.
vi: Dừng quá trình trình chiếu

source: Please stop verification or parsing before the simulation!
chs: 请在模拟之前停止验证或解析
cht: 請在模擬之前停止驗證或解析
de: Stoppen Sie bitte Überprüfung oder die Satzgliederung vor der Simulation!
ja: シミュレーションの前に検査または構文解析を中止してください
ko: 시뮬레이션을 시작하기 전에 검증이나 구문분석을 중지하십시오.
vi: Bạn phải dừng quá trình kiểm tra trước khi chạy giả lập mô hình.

source: The static method call {0} must return an integer value!
chs: 静态方法{0}必须返回整数值
cht: 靜態方法{0}必須返回整數值
de: Der statische Methodenanruf {0} muss einen Zahlwert zurückbringen!
ja: 静的メソッド呼出し{0}は整数値を戻さなければなりません!
ko: 정적 메소드 {0} 호출은 정수 값을 반환해야 합니다.
vi: Giá trị trả về của hàm {0} phải là số nguyên!

source: The input LTL is not correct:
chs: LTL公式有误
cht: LTL公式有誤
de: Das Eingang LTL ist nicht korrekt:
ja: 入力したLTLが不正です
ko: 입력 LTL에 오류가 있습니다.
vi: Công thức của tính chất cần kiểm tra không phải là một công thức LTL.

source: Graph Generated: {0} Nodes, {1} Edges
chs: 生成图有{0}个结点{1}条边
cht: 生成圖有{0}個結點{1}條邊
de: Diagramm erzeugte: {0} Nullpunkte, {1} Ränder
ja: グラフが生成されました(Node数:{0}, エッジ数:{1})。
ko: {0} 노드와 {1} 에지를 가진 그래프가 생성되었음
vi: Đồ thị gồm : {0} đỉnh, {1} cạnh

source: Normal Mode Selected
chs: 使用标准模式
cht: 使用標準模式
de: Normaler Modus wählte vor
ja: ノーマルモードが選択されました
ko: 표준 모드가 선택됨
vi: Chọn chế độ bình thường

source: Can NOT find the method
chs: 找不到这个方法
cht: 找不到這個方法
de: Kann die Methode NICHT finden
ja: 方法を見つけることができない
ko: 해당 방법을 찾을 수 없음
vi: Không tìm thấy hàm

source: The static method call {0} must return a boolean value!
chs: 静态方法{0}必须返回布尔值
cht: 靜態方法{0}必須返回布爾值
de: Der statische Methodenanruf {0} muss einen Booleschen Wert zurückbringen!
ja: 静的メソッド呼出し{0}はブール値を戻さなければなりません!
ko: 정적 메소드 {0} 호출은 boolean 값을 반환해야 합니다.
vi: Giá trị trả về của hàm {0} phải là True hoặc False!

source: Result Generation Cancelled
chs: 取消生成结果
cht: 取消生成結果
de: Resultats-Erzeugung annulliert
ja: 結果の生成が取り消されました
ko: 결과 생성이 취소되었습니다.
vi: Hủy quá trình sinh Automata

source: Parallel Verification UnSelected
chs: 取消使用并行验证
cht: 取消使用並行驗證
de: Parallele Überprüfung gemischt
ja: 並列検査の選択が解除されました
ko: 병행검증 취소
vi: Không chọn kiểm tra song song

source: Save File
chs: 保存文件
cht: 保存文件
de: Außer Akte
ja: ファイルを保存
ko: 저장
vi: Lưu file

source: The method call {0} must return an integer value!
chs: {0}方法必须返回整数值
cht: {0}方法必須返回整數值
de: Der Methodenanruf {0} muss einen Zahlwert zurückbringen!
ja: メソッド呼出し{0}は整数値を戻さなければなりません!
ko: 메소드 호출 {0}이 정수 값을 반환해야 합니다.
vi: Giá trị trả về của hàm {0} phải là số nguyên!

source: Email can not be sent! please manual email the exception to PAT team.
chs: 邮件发送失败，请选择其它方式发送
cht: 郵件發送失敗，請選擇其它方式發送
de: EMail kann nicht gesendet werden! bitte manuelle eMail die Ausnahme, zum der Mannschaft ZU TAPPEN.
ja: メールが送信できません! どうぞその例外をマニュアルでPATチームへ送ってください。
ko: 이메일 발송이 실패하였습니다. 다른 방법으로 PAT 팀에서 보내주시기 바랍니다.
vi: Gửi Email không thành công. Bạn vui lòng tự gửi lỗi cho chúng tôi.

source: Verification has been running for {0} s
chs: 验证程序已经运行{0}秒
cht: 驗證程序已經運行{0}秒
de: Überprüfung ist für {0} s gelaufen
ja: {0}のための検査が実行中です
ko: 검증 작업이 {0}초 실행중입니다
vi: Thời gian quá trình kiểm tra {0} s

source: Variables ({0}) can not be used in this expression
chs: {0}变量不能用在这个表达式中
cht: {0}變量不能用在這個表達式中
de: Variablen ({0}) können nicht in diesem Ausdruck verwendet werden
ja: 変数({0})はこの式で使用することができません
ko: {0}은 이 식에 사용할 수 없는 변수들입니다.
vi: Biến ({0}) không thể dùng trong biểu thức này.

source: Büchi Automata Generated with {0} Nodes {1} Edges (checked in {2} s).
chs: Büchii自动机有{0}个结点和{1}条边，检验它花费了{2}秒
cht: Büchi自動機有{0}個結點和{1}條邊，檢驗它花費了{2}秒
de: Die BÃ ¼ Chi Automaten, die erzeugt werden mit {0} Nullpunkten {1} umrandet (überprüftes innen {2} s).
ja: Büchiオートマトンが生成されました(ノード数:{0}, エッジ数:{1}, (checked in {2} s).
ko: {0} 개의 노드와 {1}개의 전이로 구성된 Büchii 오토마타의 검사에 {2}초가 소요되었음
vi: Büchi Automata được sinh ra với {0} trạng thái {1} cạnh (kiểm tra {2} s).

source: Can NOT find the method {0} with {1} parameters in class {2}!
chs: 在{2}类里找不到带有{1}参数的{0}方法
cht: 在{2}類別里找不到帶有{1}參數的{0}方法
de: Kann die 1} Parametern in der Kategorie {2} NICHT finden Methode {0} mit {!
ja: 方法{0} {の1つの}クラス{2}の変数見つけることができない!
ko: 클래스 {2}에서 {1}인자를 가진 메소드 {0}를 찾을 수 없음
vi: Không tìm thấy hàm {0} với {1} các thông số trong class {2}!

source: Verification Completed
chs: 完成验证
cht: 完成驗證
de: Überprüfung abgeschlossen
ja: 検査が完了しました
ko: 검증이 완료되었습니다.
vi: Quá trình kiểm tra kết thúc

source: 2. Email us your model and seek for help.
chs: 2. 发送模型
cht: 2 發送模型。
de: 2. Mailen Sie uns Ihr Modell und suchen Sie für Hilfe.
ja: 2. 私たちにモデルをメールで送り、援助を求めてください。
ko: 도움을필요하시면 모델을 이메일로 보내주세요.
vi: 2. Gửi email mô hình của bạn và tìm kiếm giúp đỡ.

source: Rabin Automata Generated with {0} Nodes {1} Edges (checked in {2}s).
chs: Rabin自动机有{0}个结点和{1}条边，检验它花费了{2}秒
cht: Rabin自動機有{0}個結點和{1}條邊，檢驗它花費了{2}秒
de: Die Rabin Automaten, die erzeugt werden mit {0} Nullpunkten {1} umrandet (überprüftes innen {2} s).
ja: ノード数:{0}, エッジ数:{1}のRabinオートマトンが生成されました (checked in {2}s).
ko: 생성된 Rabin 오토마타에는 {0} 개의 노드와 {1} 개의 전이가 있으면 검증에 {2}초가 걸렸습니다.
vi: Rabin Automata được sinh ra gồm {0} trạng thái {1} cạnh (kiểm tra trong {2}s).

source: Only a sequential program or C# method calls can be associated with an event.
chs: 仅顺序程序和C#方法调用可以同事件联合作为一个原子操作
cht: 僅順序程序和c#方法調用可以同事件聯合作為一個原子操作。
de: Nur Anrufe ein aufeinander folgendes Programm oder einer C# Methode können mit einem Ereignis verbunden sein.
ja: 逐次プログラムかC#メソッド呼び出ししかイベントに関連づけることができません。
ko: 한 이벤트에는 하나의 직렬(sequential) 프로그램이나 C 메소드 호출만 결합될 수 있습니다.
vi: Chỉ có chương trình tuần tự hoặc lời gọi hàm được sử dụng cùng với sự kiện.

source: Runtime Exception Happened
chs: 发生运行时错误
cht: 發生運行時錯誤
de: Laufzeitausnahme geschah
ja: 実行時例外が発生しました
ko: 실행시간 예외가 발생하였습니다.
vi: Có lỗi xảy ra.

source: Total transitions visited before the exception:
chs: 异常发生之前访问过的转换总数
cht: 異常發生之前訪問過的轉換總數
de: Gesamtübergänge besucht vor der Ausnahme:
ja: 全ての遷移は例外の前に訪問されました:
ko: 예외 발생까지 검사한 상태수
vi: Tổng số cạnh đã được duyệt trước khi xảy ra lỗi:

# ModelCheckingForm_CheckBox_POR_CheckedChanged_Partial_Order_Reduction_UnSelected
source: Partial Order Reduction UnSelected
chs: 取消使用偏序归约
cht: 取消使用偏序歸約
de: Teilweise Auftrags-Verkleinerung gemischt
ja: Partial Order Reductionの選択が解除されました
ko: Partial Order Reduction 취소
vi: Không chọn Partial Order Reduction

# This_error_suggests_your_model_is_ too_big_to_be_verified.
source: 1. This error suggests your model is too big to be verified. Please make sure all your variables are bounded. You can use domain range values to check it, e.g., "var x:{1..100}=0;". Alternatively you can simplify your model by using fewer events, simplier processes, and smaller constants and variables.
chs: 模型可能产生过大的状态空间导致无法验证
cht: 模型可能產生過大的狀態空間導致無法驗證
de: 1. Diese Störung schlägt vor, dass Ihr Modell zu groß ist überprüft zu werden. Stellen Sie bitte sicher, dass alle Ihre Variablen gesprungen werden. Sie können Gebietsstreckenwerte verwenden, um sie z.B. & zu überprüfen; quot; var x: {1..100} =0; & quot;. Wechselweise können Sie Ihr MO vereinfachen
ja: 1.このエラーはあなたのモデルが検査する事ができない程大きいことを示唆します。すべての変数が境界があるのを確実にしてください。あなたがそれを確認するために定義域範囲を使えます。例えば、「var x: {1.100}=0;。あるいは、あなたは、より少ないイベント、よる単純なプロセス、よりわずかな定数、および変数を使用することによって、モデルを簡素化できます。
ko: 이 에러는 모델이 너무 커서 검증할 수 없을 경우 일어날 수 있습니다.
vi: 1.Mô hình kiểm tra quá lớn. Hãy thử đặt giới hạn trên và dưới cho các biến hoặc thay đổi mô hình số lượng sự kiện nhỏ hơn, quá trình đơn giản hơn và các giá trị hằng số, biến nhỏ hơn.

source: Verbose Mode Selected
chs: 选择显示验证细节模式
cht: 選擇Verbose模式
de: Protokoll-Modus (Auflisten auf dem Bildschirm) wählte vor
ja: 冗長モードが選択されました
ko: 상세모드가 선택됨
vi: Chọn chế độ Verbose

source: Shortest Witness Trace Selected
chs: 选择最短见证迹
cht: 選擇最短見證跡
de: Kürzeste Zeuge-Spur vorgewählt
ja: 最短トレースが選択されました
ko: 최단 관찰자 트레이스가 선택되었습니다.
vi: Chọn giải thuật duyệt theo chiều rộng

source: Please select an assertion first!
chs: 请先选择一个断言
cht: 請先選擇一個斷言
de: Wählen Sie bitte eine Behauptung zuerst vor!
ja: 先にアサーションを選択してください
ko: 먼저 단언(assertion) 하나를 선택하십시오.
vi: Bạn chưa chọn tính chất cần kiểm tra.

source: The C# library {0} can not be found!
chs: 找不到C#库
cht: 找不到C#庫
de: Die C# Bibliothek {0} kann nicht gefunden werden!
ja: C#ライブラリ{0}見つけることができませｎ!
ko: C# 라이브러리 {0}를 찾을 수 없습니다.
vi: Không tìm thấy {0} thư viện C#!

source: Parallel Verification Selected
chs: 使用并行验证
cht: 使用並行驗證
de: Parallele Überprüfung wählte vor
ja: 並列検査が選択されました
ko: 병행검증 사용
vi: Chọn kiểm tra song song

source: The formula is a safety property (checked in {0} s).
chs: 检验这个安全性性质花费了{0}秒
cht: 檢驗這個安全性性質花費了{0}秒
de: Die Formel ist ein Sicherheitseigentum (überprüftes innen {0} s).
ja: この式は安全性です(checked in {0} s).
ko: 이 안전성 공식의 검증에 {0}초가 걸렸습니다.
vi: Tính chất an toàn được kiểm tra trong {0} s.

# The_simulation_is_forced_to_stop_due_to_the_huge_space_size
source: The simulation is forced to stop due to the huge space size ( > {0} states)
chs: 状态空间太大导致模拟停止
cht: 狀態空間太大導致模擬停止
de: Simulation wird gezwungen, um wegen der sehr großen Raumgröße zu stoppen ({die 0} Zustände)
ja: 空間サイズが巨大(>{0} state)のためシミュレーションはやむを得ず停止します。
ko: 공간 크기가 너무 커서 시뮬레이션이 중지되었습니다.
vi: Dừng quá trình giả lập vì số lượng trạng thái quá lớn ( > {0} trạng thái).

source: 1. Check your input model for the possiblity of errors.
chs: 1. 请检查模型中可能出现的错误。
cht: 1 請檢查模型中可能出現的錯誤。
de: 1. Überprüfen Sie Ihr Eingangsmodell auf dem possiblity von Störungen.
ja: 1. エラーの可能性が無いかどうかモデルをチェックします
ko: 입력 모델에 오류의 가능성이 있는지 확인하십시오.
vi: 1. Kiểm tra lỗi ở mô hình

source: Warning
chs: 警告
cht: 警告
de: Warnung
ja: 警告
ko: 경고
vi: Cảnh báo

source: The method call {0} must return a boolean value!
chs: {0}方法必须返回布尔值
cht: {0}方法必須返回布爾值
de: Der Methodenanruf {0} muss einen Booleschen Wert zurückbringen!
ja: メソッド呼出し{0}はブール値を戻さなければなりません!
ko: 메소드 호출 {0}이 boolean 값을 반환해야 합니다.
vi: Giá trị trả về của hàm {0} phải là True hoặc False!

source: 1. Click the Email button to report the error to us.
chs: 1. 点击“电邮”发送错误报告。
cht: 1 點擊“電郵”按鈕發送錯誤報告。
de: 1. Klicken Sie den eMail-Knopf an, um der Störung uns zu berichten.
ja: 1. 私たちへエラーを報告するためにEmailボタンを押してください
ko: 오류 리포트를 보내려면 이메일 버튼을 눌러주세요.
vi: 1. Nhấn vào nút này để gửi email thông báo lỗi.

source: Please wait for the simulation or parsing finished before verification
chs: 请等待模拟或解析完成
cht: 請等待模擬或解析完成
de: Warten Sie bitte die Simulation oder die Satzgliederung, die vor Überprüfung beendet werden
ja: 検査の前にシミュレーションまたは構文解析が停止するのを待ってください
ko: 검증이나 구문분석이 끝난 후에 시뮬레이션을 시작하십시오.
vi: Chạy quá trình kiểm tra sau khi quá trình giả lập, kiểm tra input.

source: You have following options:
chs: 你有如下选择
cht: 你有如下選擇
de: Sie haben folgende Wahlen:
ja: あなたには、次のオプションがあります:
ko: 다음과 같은 선택이 가능합니다.
vi: Có các lựa chọn sau:

source: The variable {0} must be an integer variable!
chs: {0}必须是整型变量
cht: {0}必須是整型變量
de: Die Variable {0} muss eine Ganzzahlvariable sein!
ja: 変数{0}は整変数でなければなりません!
ko: 변수 {0}은 정수형 변수라야 합니다.
vi: Biến {0} phải có kiểu nguyên!

source: Email is sent successfully.
chs: 邮件发送成功
cht: 郵件發送成功
de: EMail wird erfolgreich gesendet.
ja: メールの送信が完了しました
ko: 이메일이 성공적으로 발송되었습니다.
vi: Email đã được gửi thành công

# ModelCheckingForm_StartVerification_Verification_Starts
source: Verification Starts...
chs: 验证开始
cht: 驗證開始
de: Überprüfung beginnt…
ja: モデル検査開始
ko: 검증 시작
vi: Bắt đầu kiểm tra...

source: Apply Zeno Check UnSelected
chs: 取消使用Zeno Check
cht: 取消使用Zeno Check
de: Wenden Sie die gemischte Zeno-Überprüfung an
ja: Zenoチェックの適用が選択解除されました
ko: Zeno Check 사용을 취소하기
vi: Không sử dụng phương pháp kiểm tra Zeno

source: At same time, you can submit your model to us by using model submit button in the PAT editor.
chs: 同时你可以点击“提交”发送模型
cht: 同時你可以點擊“提交”發送模型
de: Zur gleichen Zeit können Sie Ihr Modell bei uns einreichen, indem Sie Modell verwenden, einreichen Knopf im KLAPS-Herausgeber.
ja: 同時に、あなたはモデル提出ボタンを使用してモデルを提出できます
ko: PAT 편집기에서 모델보내기 버튼을 주르면 모델을 동시에 보내실 수 있습니다.
vi: Ngay lúc này, bạn có thể gửi mô hình cho chúng tôi bằng cách nhận vào nút gửi mô hình.

source: The variable {0} must be a boolean variable!
chs: {0}必须是布尔变量
cht: {0}必須是布爾變量
de: Die Variable {0} muss eine Boolesche Variable sein!
ja: 変数{0}はブール変数でなければなりません!
ko: 변수 {0}은 boolean 변수라야 합니다.
vi: Biến {0} phải có kiểu boolean!

source: The expression {0} must be an integer expression!
chs: {0}必须是整数表达式
cht: {0}必須是整數表達式
de: Der Ausdruck {0} muss ein Zahlausdruck sein!
ja: 式{0}は整数の表現でなければなりません!
ko: 수식 {0}은 정수 식이라야 합니다.
vi: Biểu thức {0} phải là một biểu thức số nguyên!

source: Verification Cancelled
chs: 取消验证
cht: 取消驗證
de: Überprüfung annullierte
ja: 検査が取り消されました
ko: 검증이 취소되었습니다.
vi: Hủy quá trình kiểm tra

source: Error
chs: 错误
cht: 錯誤
de: Störung
ja: エラー
ko: 오류
vi: Lỗi

source: The expression should return an integer value!
chs: 表达式应该返回一个整数值
cht: 表達式應該返回一個整數值
de: Der Ausdruck sollte einen Zahlwert zurückbringen!
ja: 式は整数値を返すべきです!
ko: 식이 정수 값을 반환해야 합니다.
vi: Giá trị biểu thức phải là số nguyên!

source: Source State
chs: 源状态
cht: 源狀態
de: Quellzustand
ja: 遷移元状態
ko: 출발상태
vi: Trạng thái nguồn

source: Apply Zeno Check Selected
chs: 使用Zeno Check
cht: 使用Zeno Check
de: Wenden Sie die vorgewählte Zeno-Überprüfung an
ja: Zenoチェックの適用が選択されました
ko: Zeno Check 사용하기
vi: Sử dụng phương pháp kiểm tra Zeno

source: The expression {0} must be a boolean expression!
chs: {0}必须是布尔表达式
cht: {0}必須是布爾表達式
de: Der Ausdruck {0} muss ein Boolescher Ausdruck sein!
ja: 式{0}はブール式でなければなりません!
ko: 수식 {0}은 boolean 식이라야 합니다.
vi: Biểu thức {0} phải là một biểu thức logic!

# Exception_happened_during_the_verification
source: Runtime Exception happened during the verification
chs: 验证过程中发生异常
cht: 驗證過程中發生異常
de: Laufzeitausnahme geschah während der Überprüfung
ja: 検査中に例外が発生しました
ko: 검증 작업중에 예외가 발생하였습니다.
vi: Có lỗi trong quá trình kiểm tra.

source: Target State
chs: 目标状态
cht: 目標狀態
de: Ziel-Zustand
ja: 遷移先状態
ko: 목표상태
vi: Trạng thái đích

source: Simulation Starting
chs: 开始模拟
cht: 開始模擬
de: Simulations-Beginnen
ja: シミュレーションスタート
ko: 시뮬레이션 시작
vi: Bắt đầu quá trình giả lập

source: Trace Play Finished
chs: 轨迹重现完成
cht: 軌跡重現完成
de: Spuren-Spiel beendete
ja: トレースの再生が終了しました
ko: 트레이스의 실행이 끝났습니다.
vi: Kết thúc trình chiếu chuỗi tiến trình.

source: The execution of the step will destroy the current trace. Do you want to continue?
chs: 执行这一步会破坏当前轨迹。是否继续？
cht: 執行這一步會破壞當前軌跡。是否繼續？
de: Die Durchführung des Schrittes zerstört die gegenwärtige Spur. Möchten Sie fortfahren?
ja: ステップ実行により、現在のトレースは破棄されます。続けますか？
ko: 이것을 실행하면 현재의 트레이스가 파괴될 수 있습니다. 계속하시겠습니까?
vi: Chọn sự kiện này sẽ thay đổi quá trình giả lập hiện tại. Bạn có muốn tiếp tục?

source: Error Happened
chs: 发生错误
cht: 發生錯誤
de: Störung geschah
ja: エラーが発生しました
ko: 오류 발생
vi: Có lỗi

source: Ready
chs: 准备好
cht: 准備好
de: Bereit
ja: 準備できました
ko: 준비완료
vi: Sẵn sàng

source: Can NOT find the method {0} with {1} parameters in the imported C# libraries!
chs: 在导入的C#库里找不到带有{1}参数的{0}方法
cht: 在導入的c#庫里找不到帶有{1}參數的{0}方法
de: Kann die 1} Parametern in den importierten C# Bibliotheken NICHT finden Methode {0} mit {!
ja: 方法{0} {の1つの} C#の輸入された図書館の変数見つけることができない!
ko: 외부 C 라이브러리에서 {1} 개의 인자를 가진 메소드 {0}를 찾을 수 없음
vi: Không tìm thấy hàm {0} với {1} các thông số trong thư viện.

source: No duplicated state names are allowed!
chs: 不允许同名状态
cht: 不允許同名狀態
de: Keine kopierten Zustandnamen werden erlaubt!
ja: 状態名の重複は許されていません
ko: 이름이 중복된 상태는 허용되지 않음
vi: Lỗi! Hai trạng thái không thể có cùng tên.

source: Shortest Witness Trace UnSelected
chs: 取消选择最短见证迹
cht: 取消選擇最短見證跡
de: Kürzeste Zeuge-Spur gemischt
ja: 最短とレースの選択が解除されました
ko: 최단 관찰자 트레이스가 취소되었습니다.
vi: Không chọn giải thuật duyệt theo chiều rộng

source: 2. Click the Continue button to ingore the error.
chs: 2. 点击"继续"忽略错误。
cht: 2 點擊“繼續”忽略錯誤。
de: 2. Klicken Sie den fortsetzenknopf zum ingore die Störung.
ja: 2. エラーを無視するためにContinueボタンを押してください。
ko: 오류를 무시하려면 계속 버튼을 눌러주세요.
vi: 2. Nhấn vào nút này để bỏ qua lỗi.

source: 3. Click the Stop button to exit the application.
chs: 3. 点击“停止”退出程序
cht: 3 點擊“停止”退出程序。
de: 3. Klicken Sie die STOPP-Taste an, um die Anwendung herauszunehmen.
ja: 3. exitボタンを押してアプリケーションを停止してください。
ko: 응용프로그램을 끝내시려면 Stop 버튼을 눌러주세요.
vi: 3. Nhấn vào nút dừng để thoát chương trình.

source: Trace Play Starts...
chs: 开始重现轨迹
cht: 開始重現軌跡
de: Spuren-Spiel-Anfänge…
ja: トレースの再生スタート
ko: 트레이스의 실행을 시작합니다.
vi: Bắt đầu trình chiếu chuỗi tiến trình...

source: Generating Result...
chs: 正在生成结果
cht: 正在生成結果
de: Erzeugung Resultat…
ja: 結果の生成
ko: 결과를 생성중입니다.
vi: Tìm kiếm kết quả...

source: Please select a row in trace list as the starting point!
chs: 请在轨迹列表中选择一行作为起点
cht: 請在軌跡列表中選擇一行作為起點
de: Wählen Sie bitte eine Reihe in der Spurenliste als der Ausgangspunkt vor!
ja: 開始点としてトレースのリスト内の列を選定してください!
ko: 시작점이 될 한 줄을 트레이스 리스트에서 선택하십시오.
vi: Chọn điểm bắt đầu từ một hàng trong chuỗi tiến trình.

source: Please wait for the verification to stop first! Otherwise it may cause exceptional behaviors.
chs: 请耐心等待验证停止, 否则可能发生异常
cht: 請耐心等待驗證停止, 否則可能發生異常
de: Warten Sie bitte, dass die Überprüfung zuerst stoppt! Andernfalls kann sie außergewöhnliches Verhalten verursachen.
ja: 先に検証が止まるのを待ってください! さもなければ、それは例外的な振舞いを引き起こすかもしれません。
ko: 검증이 끝날 때까지 기다려주세요. 그렇지 않으면 예상할 수 없는 결과가 일어날 수 있습니다.
vi: Vui lòng chờ quá trình kiểm tra kết thúc nếu không lỗi có thể xảy ra.
