Repository: nhannhan159/PAT
Catalog: PAT.GUI2/FormMain.*-*.resx
Languages: cht, vi

# ToolbarButton_AddComment.Text
source: Comment Selection (Ctrl+Shift+C)
cht: 添加注釋 (Ctrl+Shift+C)
vi: Chọn comment (Ctrl+Shift+C)

# MenuButton_Languages.Text
source: Languages
cht: Languages (語言)
vi: Languages (Ngôn ngữ)

# MenuButton_ToggleAllOutlines.Text
source: Toggle All Outlinings
cht: 切換所有大綱
vi: Bật tắt tất cảl Outlinings

# ToolbarButton_ZoomIn.Text
source: Zoom In Text Font (Ctrl+Scroll Up)
cht: 放大字體
vi: Tăng font chữ

# ToolbarButton_New.Text
source: New Model
cht: 新建
vi: File mới

# MenuButton_Window.Text
source: &Window
cht: 窗口(&W)
vi: Cửa sổ

# openFileDialog1.Filter
source: LTL Files|*.ltl|All files|*.*
cht: LTL文件|*.ltl|所有文件|*.*

# MenuButton_FindNext.Text
source: Find &Next
cht: 查找下一個
vi: Tìm kế tiếp

# MenuButton_NavigateForward.Text
source: Go to &Next Tab
cht: 去前一標簽(&N)
vi: Đi đến tab kế tiếp

# MenuButton_LineCounter.Text
source: Source Code Line Counter
cht: 行數
vi: Số đếm dòng mã nguồn

# closeAllToolStripMenuItem.Text
source: Close All
cht: 關閉所有標簽
vi: Đóng tất cả

# MenuButton_Undo.Text
source: &Undo
cht: 撤銷(&U)
vi: Ngược lại

# MenuButton_Redo.Text
source: &Redo
cht: 再做(&R)
vi: Trở lại

# MenuButton_Copy.Text
source: &Copy
cht: 複制(&C)
vi: Chép

# MenuButton_Help.Text
source: &Help
cht: 幫助(&H)
vi: Giúp đỡ

# MenuButton_HelpMenu.Text
source: &Help
cht: 幫助(&H)
vi: Giúp đỡ

# MenuButton_StatusBar.Text
source: &StatusBar
cht: 狀態欄(&S)
vi: Thanh trạng thái

# MenuButton_SaveAs.Text
source: Save &As
cht: 另存爲(&A)

# MenuButton_GoTo.Text
source: &Go To...
cht: 去..行(&G)
vi: Đi đến...

# MenuButton_View.Text
source: &View
cht: 查看(&V)
vi: Xem

# MenuButton_SelectAll.Text
source: &Select All
cht: 全選(&S)
vi: Chọn tất cả

# MenuButton_Outlining.Text
source: &Outlining
cht: & 大綱

# ToolbarButton_LaTexGenerate.Text
source: Generate Latex Presentation of the Model
cht: LaTex生成
vi: Tạo biểu diễn Latex của mô hình

# MenuButton_PreviousBookmark.Text
source: Previous Bookmark
cht: 上個書簽
vi: Đánh dấu trước đó

# MenuButton_ErrorList.Text
source: &Error List
cht: & 錯誤表
vi: Danh sách lỗi

# closeAllButThisToolStripMenuItem.Text
source: Close All But This
cht: 關閉其他標簽
vi: Đóng tất cả trừ cái này

# MenuButton_ChineseTraditional.Text
source: Chinese (Traditional)
cht: 繁體中文
vi: Chinese (Phổ thông)

# $this.Text
source: WSN-PN - Congestion Detection on Wireless Sensor Network Tool
cht: PAT - 模型模擬檢驗工具 (版本
vi: PAT - Tool Mô Phỏng và Kiểm Tra Mô Hình (Version

# MenuButton_ToggleBookmark.Text
source: Toggle Bookmark
cht: 切換書簽
vi: Bật tắt ghi chú

# ToolbarButton_SubmitModel.ToolTipText
source: Email current model to PAT team or friends.
cht: 向PAT作者或朋友發送當前模型
vi: Gửi hiện tại mô hình nhóm PAT PAT để đóng góp vào dự án

# SplittoolStripMenuItem.Text
source: Split Window
cht: 劃分窗口
vi: Chia cửa sổ

# closeToolStripMenuItem.Text
source: Close
cht: 關閉
vi: Đóng

# MenuButton_EnableSimplificationOfTheFormula.Text
source: Enable &Logical simplification of the formula
cht: 啟用公式簡化
vi: Cho phép đơn giản công thức Logic

# MenuButton_LTLParsingOptions.Text
source: LTL &Parsing Options
cht: LTL解析選項
vi: chọn LTL Parsing

# MenuButton_New.Text
source: &New
cht: 新建(&N)
vi: Mới

# MenuButton_Japanese.Text
source: Japanese
cht: 日語

# ToolbarButton_Paste.Text
source: Paste (Ctrl+V)
cht: 粘貼 (Ctrl+V)

# ToolbarButton_SubmitModel.Text
source: Email Model
cht: 電郵模型
vi: Gửi mẫu cho PAT

# MenuButton_Toolbar.Text
source: &Toolbar
cht: 工具欄(&T)
vi: Thanh công cụ

# MenuButton_ToggleOutline.Text
source: Toggle Outlining
cht: 切換大綱
vi: Bật tắt Outlining

# MenuButton_CheckGrammer.Text
source: &Check Grammar
cht: 語法檢測(&C)
vi: Chọn ngữ pháp

# MenuButton_AlwaysOnTop.Text
source: &Always On Top
cht: 總是在上面(&A)
vi: Luôn ở trên cùng

# ToolbarButton_Find.Text
source: Find (Ctrl+F)
cht: 查找 (Ctrl+F)
vi: Tìm kiếm (Ctrl+F)

# MenuButton_Russian.Text
source: Russian
cht: 俄語

# MenuButton_Cut.Text
source: Cu&t
cht: 剪切(&T)
vi: Cắt

# MenuButton_EnableOntheflyAutomataSimplification.Text
source: Enable &On-the-fly automata simplification
cht: 啟用On-the-fly自動機簡化
vi: Cho phép đơn giản automata on-the-fly

# ToolbarButton_FindNext.Text
source: Find Next (F3)
cht: 查找下一個 (F3)
vi: Tìm kế tiếp (F3)

# MenuButton_Open.Text
source: &Open
cht: 打開(&O)
vi: Mở

# openFileDialog1.Title
source: Open Query File
cht: 打開文件對話框
vi: Mở file yêu cầu

# MenuButton_FindReplace.Text
source: &Find and Replace
cht: 查找和替換(&F)
vi: Tìm kiếm và thay thế

# MenuButton_ChineseSimplified.Text
source: Chinese (Simplified)
cht: 簡體中文

# MenuButton_EnableAPosterioriAutomataSimplification.Text
source: Enable a &Posteriori automata simplification
cht: 啟用APosteriori自動機簡化
vi: Cho phép đơn giản automata

# ToolbarButton_Save.Text
source: Save (Ctrl+S)
cht: 保存 (Ctrl+S)

# saveToolStripMenuItem.Text
source: Save
cht: 保存

# MenuButton_CloseCurrent.Text
source: Close Current Tab
cht: 關閉當前文件
vi: Đóng cửa sổ hiện tại

# MenuButton_French.Text
source: French
cht: 法語

# MenuButton_Vietnamese.Text
source: Vietnamese
cht: 越南語

# MenuButton_NavigateBack.Text
source: Go to &Previous Tab
cht: 去下一標簽(&P)
vi: Đi đến Tab trước đó

# MenuButton_Options.Text
source: &Options...
cht: 選項(&O)
vi: Những chọn lựa...

# MenuButton_Paste.Text
source: &Paste
cht: 粘貼(&P)
vi: Dán

# MenuButton_EnableStronglyConnectedComponentsSimplification.Text
source: Enable strongly &Connected components simplification
cht: 啟用強連通子圖簡化
vi: Cho phép đơn giản strongly &Connected components

# MenuButton_Formatting.Text
source: Formating
cht: 格式
vi: Định dạng

# MenuButton_English.Text
source: English
cht: 英語

# ToolbarButton_Copy.Text
source: Copy (Ctrl+C)
cht: 複制 (Ctrl+C)

# MenuButton_Standard.Text
source: &Standard
cht: 標準
vi: Tiêu chuẩn

# MenuButton_Website.Text
source: &Web Site
cht: PAT網址(&W)
vi: Trang web

# MenuButton_ClearAllBookmarks.Text
source: Clear All Bookmarks
cht: 清除所有書簽
vi: Xóa tất cả đánh dấu

# MenuButton_Save.Text
source: &Save
cht: 保存(&S)

# MenuButton_Split.Text
source: &Split Window
cht: & 劃分窗口
vi: ok

# ToolbarButton_SaveAs.Text
source: Save As
cht: 另存爲

# MenuButton_Edit.Text
source: &Edit
cht: 編輯(&E)
vi: Thay đổi

# MenuButton_RecentFiles.Text
source: &Recent Files
cht: 最近編輯文件(&R)
vi: Những file gần đây

# ToolbarButton_Cut.Text
source: Cut (Ctrl+X)
cht: 剪切 (Ctrl+X)
vi: Cắt (Ctrl+X)

# MenuButton_About.Text
source: &About
cht: 關于(&A)
vi: Về

# MenuButton_File.Text
source: &File
cht: 文件(&F)
vi: Tập tin

# MenuButton_Spanish.Text
source: Spanish
cht: 西班牙語

# MenuButton_German.Text
source: German
cht: 德語

# MenuButton_LTL2BA.Text
source: LTL to Automata Converter
cht: 轉換LTL公式到Buchii自動機
vi: Bộ chuyển LTL sang Automata

# MenuButton_CloseAllDocument.Text
source: &Close All Documents
cht: 關閉所有文件
vi: Đóng tất cả cửa sổ

# MenuButton_LineNumber.Text
source: &Line Number
cht: 顯示行號(&L)
vi: Số hàng

# MenuButton_NextBookmark.Text
source: Next Bookmark
cht: 下個書簽
vi: Bookmark kế tiếp

# ToolbarButton_ZoomOut.Text
source: Zoom Out Text Font (Ctrl+Scroll Down)
cht: 縮小字體
vi: Giảm font chữ

# MenuButton_Find.Text
source: &Find
cht: 查找
vi: Tìm kiếm

# ToolbarButton_RemoveComment.Text
source: Uncomment Selection (Ctrl+Shift+U)
cht: 取消注釋 (Ctrl+Shift+U)
vi: Bỏ chú thích (Ctrl+Shift+U)

# MenuButton_OutputPanel.Text
source: &Output Window
cht: 輸出窗口(&O)
vi: Panel xuất

# MenuButton_Examples.Text
source: E&xamples
cht: 例子(&X)
vi: Những ví dụ

# ToolbarButton_Zoom100.ToolTipText
source: 100% Text Size
cht: 100%文本大小
vi: 100% cỡ chữ

# MenuButton_Tools.Text
source: &Tools
cht: 工具(&T)
vi: Những công cụ

# MenuButton_Delete.Text
source: &Delete
cht: & 刪除
vi: Xóa

# MenuButton_EmailFeedback.Text
source: &Email Feedback
cht: 電子郵件反饋(&E)
vi: Gửi thư phản hồi

# ToolbarButton_Undo.Text
source: Undo (Ctrl+Z)
cht: 撤銷 (Ctrl+Z)
vi: Ngược lại (Ctrl+Z)

# MenuButton_Replace.Text
source: &Replace
cht: 替換
vi: Thay thế

# MenuButton_Import.Text
source: Import
cht: 導入
vi: Nhập vào

# MenuButton_Exit.Text
source: E&xit
cht: 退出(&X)
vi: Thoát

# StatusLabel_Status.Text
source: Ready
cht: 准備好
vi: Sẵn sàng

# openContainingFolderToolStripMenuItem.Text
source: Open Containing Folder
cht: 開放包含的文件夾
vi: Mở folder chứa

# ToolbarButton_Replace.Text
source: Replace (Ctrl+H)
cht: 替換(Ctrl+H)
vi: Thay thế (Ctrl+H)

# MenuButton_Bookmarks.Text
source: Boo&kmarks
cht: 書籤
vi: Đánh dấu

# ToolbarButton_Open.Text
source: Open Model (Ctrl+O)
cht: 打開 (Ctrl+O)
vi: Mở File (Ctrl+O)

# MenuButton_HignlightCurrentLine.Text
source: &Highlight Current Line
cht: 高亮顯示當前行(&H)
vi: Tô màu dòng này

# ToolbarButton_Redo.Text
source: Redo (Ctrl+Y)
cht: 重複 (Ctrl+Y)
vi: Sau đó (Ctrl+Y)

# MenuButton_CSharpLibary.Text
source: C# &Library Editor and Compiler
cht: C#庫編輯和編譯器(&L)
vi: Thư viện soạn thảo và compile C#

# MenuButton_Portuguese.Text
source: Portuguese
cht: 葡萄牙語

# StatusBar.Text
source: statusStrip1
vi: Thanh trạng thái

# MenuButton_EnableTrickingInAcceptingConditions.Text
source: Enable tricking in &Accepting conditions
vi: Cho phép tricking trong điều kiện chấp nhận

# MenuStrip.Text
source: menuStrip1
vi: Thanh Menu

# StandardToolBar.Text
source: toolStrip1
vi: Thanh công cụ tiêu chuẩn

# toolStripContainer1.Text
source: toolStripContainer1
vi: Thanh chứa 1
