Repository: nhannhan159/PAT
Catalog: PAT.GUI2/Forms/OptionForm.*.resx
Languages: chs, cht, ja, ko, vi

# $this.Text
source: Options
chs: 选项
cht: 選項
ja: オプション
ko: 선택사항
vi: Tùy chọn

# Button_Cancel.Text
source: Cancel
chs: 取消
cht: 取消
ja: 取り消し
ko: 취소
vi: Hủy

# Button_DefaultSetting.Text
source: Default Setting
chs: 缺省设置
cht: 缺省設置
ja: デフォルト設定
ko: 기본 설정
vi: Điều chỉnh mặc định

# Button_OK.Text
source: OK
chs: 确定
cht: 確定
ja: 了解
ko: 승인
vi: Đồng ý

# CheckBox_AutoSave.Text
source: Auto save models when actions (simulate, verification) performed
chs: 当执行模仿、证明时自动保存模型
cht: 當執行模仿、證明時自動保存模型
ja: アクション（シミュレーション、モデル検査）時の自動保存
ko: simulate, verification 수행시 모델 자동저장
vi: Tự động save mô hình khi hành động được thực hiện (mô phỏng, kiểm tra)

# CheckBox_CheckUpdate.Text
source: Check the updates before PAT starts
chs: 运行PAT之前，检查更新
cht: 運行PAT之前，檢查更新
ja: PATが始まる前に更新をチェック
ko: PAT 시작 전에 업데이트 검사하기
vi: Kiểm tra update khi PAT bắt đầu

# CheckBox_EmailSSL.Text
source: Sending Emails using SSL connection
chs: 使用SSL连接发送邮件
cht: 使用SSL連接發送郵件
ja: SSL接続を利用したメール送信
ko: SSL로 이메일 보내기
vi: Gởi email sử dụng đường truyền SSL

# CheckBox_EmailSSL.ToolTip
source: Switch this off if sending email failed
chs: 邮件发送失败时关闭连接
cht: 郵件發送失敗時關閉連接
ja: メール送信に失敗するようならオフにしてください
ko: 이메일 전송 실패할 경우 끄기
vi: Tắt nếu gởi email bị lỗi

# CheckBox_LinkCSP.Text
source: Open CSP Models (*.csp) using PAT
chs: 使用PAT打开CSP模型 (*.csp)
cht: 使用PAT打開CSP模型 (*.csp)
ja: PATを使用してCSPモデル(*.csp)を開く
ko: PAT로 CSP 모델 열기
vi: Mở mô hình CSP (*.csp) sử dụng PAT

# CheckBox_PerformDeterminization.Text
source: Perform determinization before refinement checking
chs: 精化检验前进行确定化
cht: 精化檢驗前進行確定化
ko: 개선모델 검사 수행후 결정화하기
vi: Thực hiện determinization trước khi kiểm tra refinement

# GroupBox_Simulation.Text
source: Simulation
chs: 模拟
cht: 模擬
ja: シミュレーション
ko: 시뮬레이션
vi: Mô phỏng

# GroupBox_Verification.Text
source: Verification
chs: 验证
cht: 驗證
ja: モデル検査
ko: 검증
vi: Kiểm tra

# label1.Text
source: Variable Upper Bound
ko: 변수의 상한

# label2.Text
source: Message Upper Bound
ko: 메시지의 상한

# label3.Text
source: Message Lower Bound
ko: 메시지의 하한

# label4.Text
source: Maximum Channel Message Length
ko: 채널메시지의 최대 길이

# labelEventParaMax.Text
source: Event Parameter Upper Bounds
ko: 이벤트 파라미터 상한

# labelEventParaMin.Text
source: Event Parameter Lower Bounds
ko: 이벤트 파라미터 하한

# Label_CutNumberUpperBound.Text
source: Cut Number Upper Bound for Parameterized System
chs: 参数化的系统中的Cut Number的上限
cht: 參數化的系統中的Cut Number的上限
ja: パラメータ化されたシステムのためのCut Numberの上限
ko: 매개화시스템(Parameterized System)의 Cut Number 상한
vi: Cắt số giới hạn trên cho hệ thống Parameterized

# Label_DefaultModelingLanguage.Text
source: Default Modeling Language
chs: 缺省建模语言
cht: 缺省建模語言
ja: デフォルトのモデリング言語
ko: 기본 모델링 언어
vi: Ngôn ngữ mô hình mặc định

# Label_InitialCutNumber.Text
source: Initial Cut Number for Parameterized System Abstraction
chs: 参数化的系统中的Cut Number初始值
cht: 參數化的系統中的Cut Number初始值
ja: パラメータ化されたたシステム抽象の初期 Cut Number
ko: 매개화시스템(Parameterized System)의 초기 Cut Number
vi: Số cắt ban đầu cho hệ thống Parameterized

# Label_SearchInitialSize.Text
source: Search Hash Table's Initial Size
chs: 搜索中哈希表的最初大小
cht: 搜索中哈希表的最初大小
ja: ハッシュサイズの初期値
ko: 검색 해시테이블의 초기 크기
vi: Tìm kiếm kích thước ban đầu của bản Hash table

# Label_SearchUpperBound.Text
source: State Searching Upper Bound
chs: 搜索上限
cht: 搜索上限
ja: 探索の上限
ko: 상태 검색 상한
vi: Chặn trên của kiểm tra trạng thái

# Label_VarLowerBound.Text
source: Variable Lower Bound
ko: 변수의 하한

# nudMessageLength.ToolTip
source: Maximum channel message length value. For example if this value is 2, then the channel communication c?x.y.z is not allowed since its message length is 3.
ko: 채널메시지의 최대 길이. 예를 들어, 이 값이 2일 경우, c?x.y.z 같은 메시지는 길이가 3이므로 허용되지 않게 됨.

# nudMessageLower.ToolTip
source: The lower bound of channel message. For example: c?x.y, and c!z then x, y and z must be in the range [lowerbound...upperbound]. This value is applied for all your channels.
ko: 채널메시지 길이 하한. 예를 들어, c?x.y와 c!z 이면 x,y,z는 [하한 .. 상한] 범위에 있어야 함. 이 값은 모든 채널에 적용됨.

# nudMessageUpper.ToolTip
source: The upper bound of channel message. For example: c?x.y, and c!z then x, y and z must be in the range [lowerbound...upperbound]. This value is applied for all your channels.
ko: 채널메시지 길이 상한. 예를 들어, c?x.y와 c!z 이면 x,y,z는 [하한 .. 상한] 범위에 있어야 함. 이 값은 모든 채널에 적용됨.

# NUD_MC_Initial.ToolTip
source: Set a bigger value if your model is huge. This may speed up the model checking to avoid too many re-hashing.
ja: モデルが巨大である場合、大きめの値を設定してください。頻繁なリ・ハッシュを回避することで、モデル検査の速度を上げることができるかもしれません。
ko: 모델이 아주 클 경우 더 큰 값을 지정하세요. 그렇게 하면 너무 빈번한 해싱 작업을 피하게 되어 모델 검증속도를 높일 수 있습니다.
vi: Đặt giá trị lớn hơn nếu hệ thống lớn. Điều đó có thể làm tăng tốc việc kiểm tra mô hình để tránh quá nhiều việc hash lại.

# NUD_SimulationBound.ToolTip
source: The maximum number of states that can be drawn in the Simulator.
chs: 在模拟器中，状态图数目的上限。
cht: 在模擬器中，狀態圖數目的上限。
ja: シミュレーターで描画可能な最大の状態数
ko: 시뮬레이터에서 그릴 수 있는 최대 상태 개수
vi: Số lượng trạng thái lớn nhất có thể vẽ ở Simulator.

# NUD_VarLowerBound.ToolTip
source: The default variable lower bound value. This value is applied to all variables declared without the range.
ko: 변수의 하한. 범위를 따로 선언하지 않은 모든 변수에 이 값이 적용됨

# NUD_VarUpperBound.ToolTip
source: The default variable upper bound value. This value is applied to all variables declared without the range.
ko: 변수의 상한. 범위를 따로 선언하지 않은 모든 변수에 이 값이 적용됨

# tabBDD.Text
source: BDD Settings
ko: BDD 설정

# TabPage_CSP.Text
source: CSP Module
chs: CSP (RTS) 模块
cht: CSP (RTS) 模塊
ja: CSP (TCSP)モジュール
ko: CSP 모듈
vi: Module CSP

# TabPage_General.Text
source: General
chs: 普通
cht: 普通
ja: 一般
ko: 일반
vi: Tổng quát

# textBoxEventParaMax.ToolTip
source: [A1, A2, ..., An] where Ai is the upper bound value of i.th event parameter
ko: [A1, A2, ..., An] 에서 Ai는 i 번째 이벤트의 상한값

# textBoxEventParaMin.ToolTip
source: [A1, A2, ..., An] where Ai is the lower bound value of i.th event parameter
ko: [A1, A2, ..., An] 에서 Ai는 i 번째 이벤트의 하한값
