Repository: nhannhan159/PAT
Catalog: PAT.Common/GUI/Simulator/SimulationForm.*-*.resx
Languages: chs, de, ja, vi

# Button_SpeedFast.Text
source: Fast (0.5s)
chs: 快速(0.5s)
de: Fasten Sie (0.5s)
ja: 速い(0.5秒)
vi: Nhanh (0.5s)

# Button_Direction.ToolTip
source: The direction of the graph drawing: T is top down, L is left to right
chs: 图表图画的方向： T是从上到下， L是从左到右
de: Die Richtung der Diagrammzeichnung: T ist Spitzenabstieg, L ist von links nach rechts verlaufend
ja: グラフ描画の報告を指定します。Tなら上から下へ、Lなら左から右となります
vi: Hướng của đồ thị đang vẽ: T là từ trên xuống, L là từ trái sang phải

# Button_GenerateGraph.ToolTipText
source: Generate complete state graph
chs: 生成完整的状态图
de: Erzeugen Sie komplettes Zustanddiagramm
ja: 完全なグラフを生成します
vi: Tạo đồ thị trạng thái hoàn chỉnh

# saveToolStripMenuItem.Text
source: Export Trace as Text
chs: 保存为文本
de: Export-Spur als Text
ja: トレースをテキストとして保存します
vi: Xuất chuỗi các sự kiện ra file

# Button_DisplayCounterexample.Text
source: Display Counterexample
chs: 显示反例
de: Anzeigen-Gegenbeispiel
ja: 反例表示
vi: Biểu diễn phản ví dụ

# From.Text
source: From
chs: 从
de: Von
ja: 元
vi: Từ

# Button_Simulate.Text
source: Simulate
chs: 模拟
de: Simulieren Sie
ja: シミュレーション
vi: Mô phỏng

# FromState.Text
source: State
chs: 状态
de: Zustand
ja: 遷移元状態
vi: Trạng thái

# columnHeader7.Text
source: Event
chs: 事件
de: Ereignis
ja: イベント
vi: Sự kiện

# Button_InteractionPane.Text
source: Interaction Pane
chs: 交互窗口
de: Interaktions-Scheibe
ja: インタラクション・エリア
vi: Ô tương tác

# Button_DisplaySCC.Text
source: Display Strongly Connected Components
chs: 显示强连通子图
de: Anzeigen-stark verbundene Bestandteile
ja: 強く接続されたコンポーネントの表示
vi: Biểu diễn Strongly Connected Components

# toolStripMenuItem1.Text
source: Replay from Here
chs: 从这里播放
de: Wiedergabe von hier
ja: ここから再生
vi: Chạy lại từ đây

# columnHeader10.Text
source: Src State
chs: 源状态
de: Src Zustand
ja: 遷移元状態
vi: Trạng thái nguồn

# $this.Text
source: Simulation
chs: 模拟
ja: シミュレーション
vi: Mô phỏng

# Button_Reset.Text
source: Reset
chs: 重置
de: Zurückstellen
ja: リセット

# Button_CounterExample.Text
source: Counterexample
chs: 反例
de: Gegenbeispiel
ja: 反例
vi: Phản ví dụ

# Button_20seconds.Text
source: 20 Seconds
chs: 20秒
de: 20 Sekunden
ja: 20秒
vi: 20 giây

# Button_10seconds.Text
source: 10 Seconds
chs: 10秒
de: 10 Sekunden
ja: 10秒
vi: 10 giây

# Button_60seconds.Text
source: 60 Seconds
chs: 60秒
de: 60 Sekunden
ja: 60秒
vi: 60 giây

# State.Text
source: State
chs: 状态
de: Zustand
ja: 状態
vi: Trạng thái

# columnHeader8.Text
source: Tgt State
chs: 目标状态
de: Tgt Zustand
ja: 遷移先状態
vi: Trạng thái đích

# Button_SpeedVerySlow.Text
source: Very Slow (4s)
chs: 非常慢(4s)
de: Sehr langsam (4s)
ja: かなり遅い（4秒）
vi: Rất chậm (4s)

# Button_SpeedNormal.Text
source: Normal (1s)
chs: 正常(1s)
ja: 通常速度
vi: Bình thường (1s)

# Button_SpeedVeryFast.Text
source: Very Fast (0.25s)
chs: 非常快速(0.25s)
de: Sehr schnell (0.25s)
ja: かなり速い(0.25秒)
vi: Rất nhanh (0.25s)

# GroupBox_EventTrace.Text
source: Event Trace
chs: 事件轨迹
de: Ereignis-Spur
ja: イベントトレース
vi: Chuỗi sự kiện

# Process.Text
source: Process
chs: 进程
de: Prozess
ja: プロセス
vi: Quá trình

# cpToolStripMenuItem.Text
source: Copy Target State
chs: 复制进程
de: Kopien-Prozess
ja: プロセスのコピー
vi: Copy quá trình

# ListView_EnabledEvents.ToolTip
source: Double click a row to fire the enabled event. The blue rows are the current enabled events.
chs: 双击执行事件。 蓝色显示当前状态激活事件。
de: Doppeltes Klicken eine Reihe, zum des ermöglichten Ereignisses abzufeuern. Die blauen Reihen sind die gegenwärtigen ermöglichten Ereignisse.
ja: 行をダブルクリックするとイベントが有効になります。青い行が現在有効な行です
vi: Nhấp đôi chuốt một hàng để cho phép sự kiện thực thi. Những hàng được tô xanh là những sự kiện được kích hoạt hiện thời.

# Button_Settings.Text
source: Settings
chs: 设置
de: Einstellungen
ja: 設定
vi: Những cấu hình

# Event.Text
source: Event
chs: 事件
de: Ereignis
ja: イベント
vi: Sự kiện

# columnHeader5.Text
source: Enabled Event
chs: 激活事件
de: Möglichtes Ereignis
ja: イベントを有効化
vi: Những sự kiện được kích hoạt

# Button_AnimationSpeed.Text
source: Animation Speed
chs: 动画速度
de: Animation-Geschwindigkeit
ja: アニメーション速度
vi: Tốc độ trình chiếu

# ListView_Trace.ToolTip
source: Click each row to display the trace history
chs: 点击行显示历史状态图
de: Klicken Sie jede Reihe an, um die Spurengeschichte anzuzeigen
ja: 行をクリックすると、トレースの履歴が表示されます
vi: Nhấp vào mỗi hàng để hiển thị chuỗi các sự kiện.

# Button_StatePane.Text
source: State Pane
chs: 状态栏

# copyEventToolStripMenuItem.Text
source: Copy Event
chs: 复制事件
de: Kopieren Sie Ereignis
ja: イベントのコピー
vi: Copy sự kiện

# Label_Processes.Text
source: Processes
chs: 进程
de: Prozesse
ja: プロセス
vi: Quá trình

# Button_Export.Text
source: Export
chs: 导出
ja: エクスポート
vi: Xuất

# columnHeader1.Text
source: Event
chs: 事件
de: Ereignis
ja: イベント
vi: Sự kiện

# Button_40seconds.Text
source: 40 Seconds
chs: 40秒
de: 40 Sekunden
ja: 40秒
vi: 40 giây

# hideTauTransitionToolStripMenuItem.Text
source: Hide Tau Transitions
chs: 隐藏tau转换
ja: tau遷移を隠します
vi: Ẩn các sự kiện Tau

# columnHeader2.Text
source: To
chs: 到
de: Zu
ja: 遷移先
vi: Đến

# Button_PlayTrace.Text
source: Play Trace
chs: 播放事件踪迹
de: Spiel-Spur
ja: トレース再生
vi: Biểu diễn chuỗi sự kiện

# Button_GenerateGraph.Text
source: Generate Graph
chs: 生成状态图
de: Erzeugen Sie Diagramm
ja: グラフの生成
vi: Tạo đồ thị

# Button_SpeedSlow.Text
source: Slow (2s)
chs: 慢速(2s)
de: Verlangsamen Sie (2s)
ja: 遅い（2秒)
vi: Chậm (2s)

# GroupBox_EnabledEvents.Text
source: Enabled Events
chs: 激活事件
de: Ermöglichte Ereignisse
ja: イベントの有効化
vi: Những sự kiện được kích hoạt

# Button_5seconds.Text
source: 5 Seconds
chs: 5秒
de: 5 Sekunden
ja: 5秒
vi: 5 giây

# Button_PopupDelay.Text
source: Tooltip Popup Delay
chs: 提示显示延迟
de: Tooltip Popup- Verzögerung
ja: ツールチップのポップアップ表示の遅延時間
vi: Thời gian hiển thị thông tin

# columnHeader4.Text
source: Src State
chs: 源状态
de: Ausgangszustand
ja: 遷移元状態
vi: Trạng thái nguồn

# Button_Simulate.ToolTipText
source: Perform animated random simulation
chs: 开始随机模拟
de: Durchführen Sie lebhafte gelegentliche Simulation iche
ja: ランダム・シミュレーションを実行します
vi: Thực thi mô phỏng động một cách ngẫu nhiên

# Button_Direction.Text
source: TB
ja: 描画方向

# statusStrip1.Text
source: statusStrip1
vi: Trạng thái
