Repository: nhannhan159/PAT
Catalog: PAT.GUI2/Properties/Resources.*-*.resx
Languages: cht, ja, vi

source: Please wait for the verification to stop first! Otherwise it may cause exceptional behaviors.
cht: 請耐心等待驗證停止, 否則可能發生異常
ja: 検査が止まるのを待ってください! さもなければ、それは例外的な振舞いを引き起こすかもしれません。
vi: Chờ quá trình kiểm tra kết thúc ,nếu không có thể lỗi sẽ xảy ra!

source: Grammar Checked
cht: 語法檢測完成
ja: 構文がチェックされました
vi: Kiểm tra ngữ pháp

source: C# library code is saved successfully!
cht: 成功保存c#庫的源代碼
ja: C#ライブラリコードは保存されました。
vi: Thư viện C# được lưu thành công!

source: Are you sure you want to delete the selected process?
cht: 你確定刪除選中的進程嗎？
ja: 選択されたプロセスを削除してもよろしいですか？
vi: Bạn có muốn xóa quá trình được chọn không?

source: Please stop verification or simulation before parsing the model!
cht: 請在解析模型之前停止模擬或驗證！
ja: モデルを構文解析する前に、検証またはシミュレーションを止めてください!
vi: Dừng quá trình kiểm tra hoặc mô phỏng trước khi biên dịch!

source: Line number
cht: 行數
ja: 行番号
vi: Số dòng

source: Normal Mode Selected
cht: 選擇標准模式
ja: ノーマルモードが選択されました
vi: Chọn lựa chế độ thông thường

source: Parallel Verification UnSelected
cht: 取消選擇並行驗證
ja: 並列検査が選択解除されました
vi: Không chọn kiểm tra song song

source: Result Generation Cancelled
cht: 取消生成結果
ja: 結果の生成は中止しました
vi: Hủy quá trình sinh kết quả

source: Exception happened:
cht: 異常發生在：
ja: 例外が発生しました:
vi: Có lỗi xảy ra:

source: Generate Counterexample UnSelected
cht: 取消選擇產生反例
ja: 反例の生成が選択解除されました
vi: Sinh ra phản ví dụ không được lựa chọn

source: Error
cht: 錯誤
ja: エラー
vi: Lỗi

source: BDD Selected
cht: 使用二值決策圖
ja: BDDが選択されている
vi: Sử dụng BDD

source: Checking file:
cht: 檢驗文件：
ja: ファイルチェック:
vi: Kiểm tra file:

source: Exception happened during the Contracts compilation:
cht: 編譯Contracts時發生錯誤
ja: コントラクトコンパイル時に例外が発生しました:
vi: Lỗi xảy ra khi biên dịch kiểu Contracts:

# Verification_has_been_running_for_
source: Verification has been running for {0}s
cht: 驗證已經花費
ja: {0}のための検査が実行中です
vi: Quá trình kiểm tra thực hiện trong {0}s

source: The Promela model is empty!
cht: 空的Promela模型！
ja: Promelaモデルが空です!
vi: Mô hình Promela rỗng.

source: Specification is parsed in {0}s
cht: 解析規範花費{0}秒
ja: 仕様は{0}で解析されます
vi: Chương trình được biên dịch trong {0}s.

source: This file is read only. Do you want to overwrite it?
cht: 文件是只讀的。確定要覆蓋它？
ja: このファイルは読み込み専用です。上書きしますか?
vi: File này chỉ đọc. Bạn có muốn ghi đè lên không?

source: Partial Order Reduction UnSelected
cht: 取消選擇偏序歸約
vi: Không chọn Partial Order Reduction

source: Verification Starts...
cht: 驗證開始
ja: 検査開始
vi: Bắt đầu quá trình kiểm tra...

source: Verbose Mode Selected
cht: 選擇顯示驗證細節
ja: 冗長モードが選択されました
vi: Chọn chế độ hiển thị chi tiết

source: Please input a valid output file!
cht: 請先輸入一個正確的輸出文件！
ja: 有効な出力ファイルを入力してください!
vi: Hãy chọn một file xuất ra hợp lệ!

source: Duplicate Process Name
cht: 進程名重復
ja: 重複したプロセス名
vi: Tên quá trình đã được sử dụng trước đó

source: File format is not supported by PAT!
cht: PAT不支持該文件格式
ja: PATのサポートしていないファイルフォーマットです!
vi: Định dạng file không được hỗ trợ!

source: Please input a model first!
cht: 請先輸入一個模型！
ja: 始めにモデルを入力してください!
vi: Hãy nhập mô hình trước!

source: Runtime Exception Happened
cht: 發生運行時錯誤
ja: 実行時例外が発生しました
vi: Lỗi xảy ra.

source: Invalid email address.
cht: 電子郵件地址不正確
ja: 無効なメールアドレス
vi: Email không hợp lệ!

source: Invalid name!
cht: 名字不正確
ja: 無効な名前!
vi: Tên không hợp lệ!

source: Parsing error at line
cht: 解析錯誤發生在
ja: 構文エラー line
vi: Lỗi biên dịch ở dòng

source: Loading error
cht: 導入錯誤
ja: ロードエラー
vi: Lỗi xảy ra khi load file

source: Partial Order Reduction Selected
cht: 選擇偏序歸約
vi: Chọn Partial Order Reduction

source: Error happened in opening
cht: 打開文件時發生錯誤
ja: オープン時にエラーが発生しました
vi: Lỗi xảy ra khi mở file

source: At least one process is needed in the model.
cht: 模型中應該至少有一個進程
ja: モデルには少なくとも１つのプロセスが必要です
vi: Ít nhất một quá trình phải được chọn trong mô hình.

source: Saving error
cht: 保存錯誤
ja: 保存エラー
vi: Lỗi xảy ra khi lưu

source: Parallel Verification Selected
cht: 選擇並行驗證
ja: 並列検査が選択されました
vi: Chọn kiểm tra song song

source: Email is sent successfully.
cht: 發送郵件成功
ja: メール送信は成功しました。.
vi: Email được gởi thành công

source: Generating Result...
cht: 正在生成結果……
ja: 結果を生成しています...
vi: Sinh ra kết quả

source: Verifying Assertion:
cht: 驗證的斷言：
ja: アサーションの検証:
vi: Tính chất đang được kiểm tra:

source: Exception happened during the compilation:
cht: 編譯時發生異常
ja: コンパイル時に例外が発生しました
vi: Lỗi xảy ra khi biên dịch:

source: Verification Completed
cht: 驗證完成
ja: 検査は完了しました
vi: Kiểm tra thành công.

source: Apply Zeno Check UnSelected
cht: 取消使用 Zeno Check
ja: Zenoチェックの適用が選択解除されました
vi: Không sử dụng kiểm tra Zeno

source: Save Output File
cht: 保存輸出文件
ja: 出力ファイルを保存
vi: Lưu file xuất ra

source: running on
cht: 運行在
vi: Đang chạy

source: Error happned in loading module
cht: 導入模塊時發生錯誤
ja: モジュールのロード時にエラーが発生
vi: Lỗi xảy ra khi load module

source: Open Error: the selected file is not found!
cht: 打開錯誤：找不到選中文件
ja: オープンエラー: 選択されたファイルが見つかりません
vi: Lỗi: File không tồn tại

source: Generate Counterexample Selected
cht: 選擇產生反例
ja: 反例の生成が選択されました
vi: Sinh ra phản ví dụ được lựa chọn

source: Shortest Witness Trace Selected
cht: 選擇最短見證跡
ja: 最短トレースが選択されました
vi: Chọn chế độ tìm phản ví dụ ngắn nhất

source: Please make sure that the format is correct!
cht: 請確保格式正確
ja: フォーマットが確実に正しくなるようにしてください!
vi: Kiểm tra định dạng hợp lệ!

source: Verification Cancelled
cht: 取消驗證
ja: 検査が中止されました
vi: Hủy quá trình kiểm tra

source: Exception happened during saving:
cht: 保存時發生異常
ja: 保存中に例外が発生しました:
vi: Lỗi xảy ra khi lưu file:

source: Promela Model Translated
cht: 轉換Promela模型完成
ja: Promelaモデルは変換されました
vi: Dịch mô hình Promela

source: BDD UnSelected
cht: 取消使用二值決策圖
ja: BDDが選択されていない
vi: Không sử dụng BDD

source: C# library is built successfully! You can use them now in your models.
cht: 成功構建C#庫，你現在可以在模型中使用它們。
ja: C#ライブラリのビルドが成功しました。あなたは今からそれらをあなたのモデル内で利用できます。
vi: Thư viện C# được xây dựng thành công!! Bây giờ bạn có thể sử dụng nó trong mô hình

source: Please select some input files!
cht: 請選擇一些輸入文件
ja: 入力ファイルを選択してください!
vi: Chọn một số file nhập vào!

source: Apply Zeno Check Selected
cht: 使用 Zeno Check
ja: Zenoチェックの適用が選択されました
vi: Sử dụng kiểm tra Zeno

source: column
cht: 列
vi: Cột

source: Error: file format is not supported!
cht: 錯誤：不支持該文件格式
ja: エラーr: サポートされないファイル形式です!
vi: Lỗi: Định dạng file không được hỗ trợ!

source: An error occurred while compiling the C# code:
cht: 編譯c#源代碼時出現一個錯誤
ja: C#のコンパイル中にエラーが発生
vi: Lỗi biên dịch code C#:

source: Document {0} unsaved. Do you want to save it before close?
cht: 文件 {0}還沒保存。你想在關閉前保存它嗎？
ja: ドキュメント{0} は保存されていません. 事前に保存しますか？
vi: Tài liệu {0} chưa được lưu lại. Bạn có muốn lưu trước khi đóng không?

source: Double click to open the folder of
cht: 雙擊打開文件夾
vi: Nhấp chuột 2 lần để mở thư mục

source: Confirmation
cht: 確認
vi: Xác nhận

source: No duplicated process names are allowed
cht: 不允許同名進程名
ja: プロセス名の重複は許されません
vi: Tên quá trình đã được sử dụng trước đó

source: UML Model Translated
cht: 轉換UML模型完成
ja: UMLモデルが変換されました
vi: Dịch mô hình UML

source: Shortest Witness Trace UnSelected
cht: 取消選擇最短見證跡
ja: 最短とレースの選択が解除されました
vi: Không chọn chế độ tìm phản ví dụ ngắn nhất

source: Please load a model first!
cht: 请先导入一个模型！
ja: 始めにモデルをロードしてください!
vi: Hãy load mô hình trước!

source: Parsing error:
cht: 解析錯誤
ja: 構文エラー:
vi: Lỗi biên dịch

source: Sending Email failed.
cht: 發送郵件失敗
ja: メールの送信が失敗
vi: Gửi email không thành công.

source: Open Error:
cht: 打開錯誤
ja: オープンエラー:
vi: Lỗi xảy ra khi mở file

source: Document
cht: 文件
ja: ドキュメント
vi: Tài liệu
